app/views/help_requests/_form.html.erb

          <%= form.label :subject_id, class:"field_title"%>
          <%= form.select :subject_id, options_for_select(Subject.all.pluck(:name, :id), selected: form.object.subject), {},  class: "field_input select" %>
---
SELECT "subjects"."name", "subjects"."id" FROM "subjects"