app/controllers/application_controller.rb

  def current_request
    if current_user.student?
      @help_requests = current_user.help_requests
    else
      @help_requests = HelpRequest.where(state: 0)
---
SELECT "help_requests".* FROM "help_requests" WHERE "help_requests"."state" = ?  [["state", 0]]

  def account
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]