app/controllers/payment_sources_controller.rb

SELECT "payment_sources".* FROM "payment_sources"
---
  def index
    @payment_sources = PaymentSource.all

SELECT  "payment_sources".* FROM "payment_sources" WHERE "payment_sources"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_payment_source
      @payment_source = PaymentSource.find(params[:id])